andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2013(2014-2016) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_rspi_rx.c
* Device(s)    : RX Family
* Tool-Chain   : Renesas RX Standard Toolchain 2.05.00
* OS           : None
* H/W Platform :
* Description  : Functions for using RSPI on RX devices.
************************************************************************************************************************
* History : DD.MM.YYYY Version Description           
*         : 25.10.2013 1.00     First Release
*           01.05.2014 1.20     Added support for RX62N. Minor bug fixes.
*           19.01.2014 1.30     Added support for RX113, RX64M, and RX71M
*                               Fixed bug in R_RSPI_Control(). Now allow ABORT command while locking is enabled.
*           30.09.2016 1.50     Added support for RX130, RX23T, RX24T and RX65N.
*                               Supported big endian.
*                               Added nop() to wait for the write completion.
***********************************************************************************************************************/
/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Defines for RSPI support */
#include "platform.h"
#include "r_rspi_rx_if.h"

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
typedef enum
{   // Values will be used as bit flags.
    RSPI_DO_TX    = 0x1,
    RSPI_DO_RX    = 0x2,
    RSPI_DO_TX_RX = 0x3
} rspi_operation_t;

typedef struct rspi_tcb_s
{
   void     *psrc;
   void     *pdest;
   uint16_t tx_count;
   uint16_t rx_count;
   uint16_t xfr_length;
   uint8_t  bytes_per_transfer;     /* Source buffer bytes per transfer: 1, 2, or 4. */
   bool     do_rx_now;              /* State flag for valid read data available. */
   bool     do_tx;                  /* State flag for transmit operation. */
   rspi_operation_t  transfer_mode; /* Transmit only, receive only, or transmit-receive. */
   #if RSPI_CFG_MASK_UNUSED_BITS == (1)
   uint32_t unused_bits_mask;       /* For masking the unused upper bits of non power-of-2 data. */
   #endif
} rspi_tcb_t;

/* Driver internal shadow copy of register settings. */
typedef struct rspi_ctrl_reg_values_s
{
    uint8_t spcr_val;   /* RSPI Control Register (SPCR). */
    uint8_t sslp_val;   /* RSPI Slave Select Polarity Register (SSLP) */
    uint8_t sppcr_val;  /* RSPI Pin Control Register (SPPCR) */
    uint8_t spscr_val;  /* RSPI Sequence Control Register (SPSCR) */
    uint8_t spbr_val;   /* RSPI Bit Rate Register (SPBR). */
    uint8_t spdcr_val;  /* RSPI Data Control Register (SPDCR) */
    uint8_t spckd_val;  /* RSPI Clock Delay Register (SPCKD) */
    uint8_t sslnd_val;  /* RSPI Slave Select Negation Delay Register (SSLND) */
    uint8_t spnd_val;   /* RSPI Next-Access Delay Register (SPND) */
    uint8_t spcr2_val;  /* RSPI Control Register 2 (SPCR2) */
    uint8_t spdcr2_val; /* RSPI Data Control Register 2 (SPDCR2) */
} rspi_ctrl_reg_values_t;

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#if RSPI_CFG_USE_CH2 == 1
    #define RSPI_NUM_CHANNELS (3)
#elif RSPI_CFG_USE_CH1 == 1
    #define RSPI_NUM_CHANNELS (2)
#elif RSPI_CFG_USE_CH0 == 1
    #define RSPI_NUM_CHANNELS (1)
#else
    #error "ERROR in r_rspi_rx configuration. Must enable at least 1 channel for use."
#endif

#define RSPI_POWER_ON (0)
#define RSPI_POWER_OFF (1)

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

/* Array of channel handles. One for each physical RSPI channel on the device. */
static struct rspi_config_block_s g_rspi_handles[RSPI_NUM_CHANNELS];

/* Used to prevent having duplicate code for each channel. This only works if the channels are identical (just at 
   different locations in memory). This is easy to tell by looking in iodefine.h and seeing if the same structure
   was used for all channels. */
volatile struct st_rspi __evenaccess * g_rspi_channels[RSPI_NUM_CHANNELS] =
{
/* Initialize the array for up to 3 channels. Add more as needed. */
#if   RSPI_NUM_CHANNELS == 1
    &RSPI0,
#elif RSPI_NUM_CHANNELS == 2
    &RSPI0, &RSPI1
#elif RSPI_NUM_CHANNELS == 3
    &RSPI0, &RSPI1, &RSPI2
#endif
};

static volatile uint32_t g_rxdata[RSPI_NUM_CHANNELS]; /* Space for fast read of RSPI RX data register. */

/* Allocate transfer control blocks for all channels. */
static struct rspi_tcb_s g_rspi_tcb[RSPI_NUM_CHANNELS] = {0};
/* Allocate transaction result code storage for all channels. */
static rspi_callback_data_t g_rspi_cb_data[RSPI_NUM_CHANNELS] = {0};

