andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    /* Check channel number. */
    if (channel >= RSPI_NUM_CHANNELS)
    {
        /* Invalid channel. */
        return RSPI_ERR_BAD_CHAN;
    }

    if ((NULL == pconfig) || (NULL == phandle))
    {
        return RSPI_ERR_NULL_PTR;
    }

    /* Check to see if the peripheral has already been initialized. */
    if (true == g_rspi_handles[channel].rspi_chnl_opened)
    {
        /* This channel has already been initialized. */
        return RSPI_ERR_CH_NOT_CLOSED;
    }
    #endif

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this RSPI channel. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));

    if(false == lock_result)
    {
        return RSPI_ERR_LOCK; /* The open function is currently locked. */
    }
    #endif

    power_on_off(channel, RSPI_POWER_ON);

    if (0 == channel)
    {
        rspi_ir_priority_set(channel, RSPI_IR_PRIORITY_CHAN0);
    }
    #if RSPI_NUM_CHANNELS > 1
    else if (1 == channel)
    {
        rspi_ir_priority_set(channel, RSPI_IR_PRIORITY_CHAN1);
    }
    #endif
    #if RSPI_NUM_CHANNELS > 2
    else if (2 == channel)
    {
        rspi_ir_priority_set(channel, RSPI_IR_PRIORITY_CHAN2);
    }
    #endif
    else
    {
        /* Nothing else. */
    }

    /* Disable interrupts in ICU. */
    rspi_interrupts_enable(channel, false);

    /* Set the base bit rate. Modifies the SPBR register setting with requested baud rate.*/
    if (0 == rspi_baud_set(channel, pconfig->bps_target))
    {   // Failed
        #if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
        #endif
        return RSPI_ERR_ARG_RANGE; /* Could not calculate settings for the requested baud rate. */
    }

    /* Set pin control register (SPPCR) */
    (*g_rspi_channels[channel]).SPPCR.BYTE = (uint8_t)(my_settings->sppcr_val & RSPI_SPPCR_MASK);

    /* Set slave select polarity register (SSLP). */
    (*g_rspi_channels[channel]).SSLP.BYTE = (uint8_t)(my_settings->sslp_val & RSPI_SSLP_MASK);

    /* Apply the SPBR setting. */
    (*g_rspi_channels[channel]).SPBR = my_settings->spbr_val;

    /* Set RSPI data control register (SPDCR). Only SPLW bit supported in this ver. */
    /* Force to long word data access here regardless of user defined setting. */
    (*g_rspi_channels[channel]).SPDCR.BYTE = RSPI_SPDCR_SPLW;

    /* Set RSPI clock delay registers (SPCKD) */
    (*g_rspi_channels[channel]).SPCKD.BYTE = (uint8_t)(my_settings->spckd_val & RSPI_SPCKD_MASK);

    /* Set RSPI slave select negation delay register (SSLND) */
    (*g_rspi_channels[channel]).SSLND.BYTE = (uint8_t)(my_settings->sslnd_val & RSPI_SSLND_MASK);

    /* Set RSPI next-access delay register (SPND) */
    (*g_rspi_channels[channel]).SPND.BYTE = (uint8_t)(my_settings->spnd_val & RSPI_SPND_MASK);

    /* Set RSPI control register 2 (SPCR2) */
    (*g_rspi_channels[channel]).SPCR2.BYTE = (uint8_t)(my_settings->spcr2_val & RSPI_SPCR2_MASK);

#if defined BSP_MCU_RX65N
    /* Set RSPI data control register 2 (SPDCR2) */
    (*g_rspi_channels[channel]).SPDCR2.BYTE = (uint8_t)(my_settings->spdcr2_val & RSPI_SPDCR2_MASK);
#endif

    /* Determine master/slave mode setting based on channel settings argument.
     * Overrides prior state for this bit . */
    if (RSPI_MS_MODE_MASTER == pconfig->master_slave_mode)
    {
        my_settings->spcr_val |= RSPI_MS_MODE_MASTER;   // Set the master mode bit
    }
    else
    {
        my_settings->spcr_val &= RSPI_MS_MODE_SLAVE;    // Clear the master mode bit
    }

    /* Determine RSPI slave select mode setting based on channel settings argument.
     * Overrides prior state for this bit . */
    if (RSPI_IF_MODE_4WIRE == pconfig->gpio_ssl)
    {
        my_settings->spcr_val &= RSPI_IF_MODE_4WIRE; // Clear the SPMS bit
    }
    else
    {
        my_settings->spcr_val |= RSPI_IF_MODE_3WIRE; // Set the SPMS bit
    }
    /* Set RSPI control register (SPCR) */
    (*g_rspi_channels[channel]).SPCR.BYTE = my_settings->spcr_val;
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        nop();
    }
    
    /* Peripheral Initialized */
    g_rspi_handles[channel].rspi_chnl_opened = true;
    g_rspi_handles[channel].pcallback = pcallback;
    g_rspi_handles[channel].channel = channel;

    *phandle = &(g_rspi_handles[channel]);  // Return a pointer to the channel handle structure.

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Release lock for this channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
    #endif

    return RSPI_SUCCESS;
}
/* end of function R_RSPI_Open(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_Control
* Description  : This function is responsible for handling special hardware or software operations for the RSPI channel.
* Arguments    : handle-
*                   Handle for the channel
*                cmd
*                   Enumerated command code
*                pcmd_data
*                   Pointer to the command-data structure parameter of type void that is used to reference the location
*                   of any data specific to the command that is needed for its completion.
* Return Value : RSPI_SUCCESS-
*                   Command successfully completed.
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_UNKNOWN_CMD-
*                   Control command is not recognized.
*                RSPI_ERR_NULL_PTR-
*                   pcmd_data  pointer or handle is NULL
*                RSPI_ERR_ARG_RANGE-
*                   An element of the pcmd_data structure contains an invalid value.
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Control(rspi_handle_t handle,
                           rspi_cmd_t     cmd,
                           void          *pcmd_data)
{
    /* Command function data structure definitions. One for each command in rspi_cmd_t. */
    rspi_cmd_baud_t        *p_baud_struct;
    rspi_cmd_setregs_t     *p_setregs_struct;
    uint8_t                 reg_temp = 0;
    uint8_t                 channel  = handle->channel;
    rspi_ctrl_reg_values_t *new_reg_settings = &(g_ctrl_reg_values[channel]);

    #if RSPI_CFG_REQUIRE_LOCK == 1
    bool        lock_result = false;
    #endif

