andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if ((NULL == handle) || ((NULL == pcmd_data) && ((void *)FIT_NO_PTR != pcmd_data)))
    {
        return RSPI_ERR_NULL_PTR;
    }
    if (!g_rspi_handles[channel].rspi_chnl_opened)
    {
        return RSPI_ERR_CH_NOT_OPENED;
    }
    #endif

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this RSPI channel. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));

    if((false == lock_result)&&(RSPI_CMD_ABORT != cmd)) // Only abort cmd is allowed while transfer in progress.
    {
        return RSPI_ERR_LOCK; /* The control function is currently locked. */
    }
    #endif

    switch(cmd)
    {
        case RSPI_CMD_SET_BAUD:
        {
            p_baud_struct = (rspi_cmd_baud_t *)pcmd_data;

            reg_temp = (*g_rspi_channels[channel]).SPCR.BYTE; /* Temporarily save state of the SPCR register. */

            /* Temporarily disable the RSPI operation. */
            /* SPE and SPTIE should be cleared simultaneously. */
            (*g_rspi_channels[channel]).SPCR.BYTE = (uint8_t)(reg_temp & (~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPE)));
            if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
            {
                nop();
            }

            /* Update the baud rate. */
            /* Get the register settings for requested baud rate. */
            if (0 == rspi_baud_set(channel, p_baud_struct->bps_target))
            {
                #if RSPI_CFG_REQUIRE_LOCK == 1
                /* Release lock for this channel. */
                R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
                #endif
                return RSPI_ERR_ARG_RANGE; /* Could not calculate settings for the requested baud rate. */
            }

            (*g_rspi_channels[channel]).SPCR.BYTE = reg_temp; /* Re-enable the RSPI operation. */
            if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
            {
                nop();
            }
        }
        break;

        case RSPI_CMD_ABORT:
        {
             /* Perform immediate abort of the active RSPI transfer on this channel.
             * Does not close the channel. */
            rspi_interrupts_enable(channel, false); /* Disable interrupts in ICU. */
            (*g_rspi_channels[channel]).SPCR.BIT.SPE = 0;  /* Disable RSPI. Forces soft reset. */
            if (0 == (*g_rspi_channels[channel]).SPCR.BIT.SPE)
            {
                nop();
            }

            /* Transfer aborted. Call the user callback function passing pointer to the result structure. */
            if((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
            {
                g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
                g_rspi_cb_data[channel].event_code = RSPI_EVT_TRANSFER_ABORTED;
                g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
            }

        }
        break;

        case RSPI_CMD_SETREGS:   // Expert use only! Set all user supported RSPI regs in one operation.
        {
            /* Overrides driver default settings.
             * Copies user-specified register settings into driver's shadow copy.
             * Settings do not take effect until the channel is closed and then reopened.
             */
            p_setregs_struct = (rspi_cmd_setregs_t *)pcmd_data;
            new_reg_settings->spckd_val = p_setregs_struct->spckd_val;
            new_reg_settings->spcr2_val = p_setregs_struct->spcr2_val;
            new_reg_settings->spnd_val  = p_setregs_struct->spnd_val;
            new_reg_settings->sppcr_val = p_setregs_struct->sppcr_val;
            new_reg_settings->sslnd_val = p_setregs_struct->sslnd_val;
            new_reg_settings->sslp_val  = p_setregs_struct->sslp_val;
#if defined BSP_MCU_RX65N
            new_reg_settings->spdcr2_val = p_setregs_struct->spdcr2_val;
#endif
        }
        break;

        default:
        {
            #if RSPI_CFG_REQUIRE_LOCK == 1
            /* Release lock for this channel. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
            #endif
            /* Error, command not recognized. */
            return RSPI_ERR_UNKNOWN_CMD;
        }
    }

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Release lock for this channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
    #endif

    return RSPI_SUCCESS;
}
/* end of function R_RSPI_Control(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_Read
* Description  : Receives data from a SPI device.
* Arguments    : handle-
*                   Handle for the channel
*                spcmd_command_word-
*                   bitfield data consisting of all the RSPI command register settings for SPCMD for this operation.
*                   This value will be placed directly into the SPCMD register by the function. Caller is required to
*                   provide correctly formatted data.
*                pdest-
*                   Pointer to destination buffer into which data will be copied that is received from a SPI .
*                   It is the responsibility of the caller to insure that adequate space is available to hold the
*                   requested data count.
*                length-
*                   Indicates the number of data words to be transferred. The size of the data word is determined from
*                   the channel configuration data structure referenced by the channel handle.
* Return Value : RSPI_SUCCESS-
*                   Read operation successfully completed.
*                RSPI_ERR_CH_NOT_OPENED-
*                   The channel has not been opened.  Perform R_RSPI_Open() first
*                RSPI_ERR_NULL_PTR-
*                   A required pointer argument is NULL
*                RSPI_ERR_LOCK-
*                      The lock could not be acquired. The channel is busy.
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Read(rspi_handle_t        handle,
                        rspi_command_word_t  spcmd_command_word,
                        void                *pdest,
                        uint16_t             length)
{
    rspi_err_t  result;

