andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
/***********************************************************************************************************************
* Function Name: R_RSPI_Close
* Description  : Removes power to the RSPI channel designated by the handle and disables the associated interrupts.
* Arguments    : handle-
*                    Handle for the channel
* Return Value : RSPI_SUCCESS-
*                    Successful; channel closed
*                RSPI_ERR_CH_NOT_OPENED-
*                    The channel has not been opened so closing has no effect.
*                RSPI_ERR_NULL_PTR-
*                    A required pointer argument is NULL
***********************************************************************************************************************/
rspi_err_t  R_RSPI_Close(rspi_handle_t handle)
{
    uint8_t channel;

    #if RSPI_CFG_PARAM_CHECKING_ENABLE == 1
    if (NULL == handle)
    {
        return RSPI_ERR_NULL_PTR;
    }
    #endif

    channel = handle->channel;

    /* Check to see if the channel is currently initialized. */
    if (false == g_rspi_handles[channel].rspi_chnl_opened)
    {
        /* This channel is not open so need not be closed. */
        return RSPI_ERR_CH_NOT_OPENED;
    }

    /* Disable the RSPI operation. */
    /* SPE and SPTIE should be cleared simultaneously. */
    (*g_rspi_channels[channel]).SPCR.BYTE &= (uint8_t)(~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPE));
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        nop();
    }

    power_on_off(channel, RSPI_POWER_OFF);

    rspi_interrupts_enable(channel, false); /* Disable interrupts. */

    g_rspi_handles[channel].rspi_chnl_opened = false;

    return RSPI_SUCCESS;
}
/* end of function R_RSPI_Close(). */


/***********************************************************************************************************************
* Function Name: rspi_baud_set
* Description  : Determines the RSPI channel SPBR register setting for the requested baud rate.
*                Returns the actual bit rate that the setting will achieve which may differ from requested.
*                If the requested bit rate cannot be exactly achieved, the next lower bit rate setting will be applied.
*                If successful, applies the calculated setting to the SPBR register.
* Arguments    :
* Return Value :
* Note: Target baud must be >= PCLK/4 to get anything out.
* Limitations   : Does not track dynamically changing PCLK. Relies on constant BSP_PCLKB_HZ
***********************************************************************************************************************/
static uint32_t rspi_baud_set(uint8_t channel, uint32_t bps_target)
{
    uint8_t     spbr_result = 0;
    uint32_t    bps_calc = 0;
    int32_t     f;  //Frequency
    int32_t     n;  //n term in equation
    int32_t     N;  //N term in equation

    /* Starting with RX63x MCUs and later, there are 2 peripheral clocks: PCLKA and PCLKB.
     * PCLKB matches the functionality of PCLK in RX62x devices as far as the RSPI is concerned. */
    #if defined(BSP_MCU_RX62_ALL)
        f = BSP_PCLK_HZ;
    #elif defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N)
        f = BSP_PCLKA_HZ;
    #else
        f = BSP_PCLKB_HZ;
    #endif

    /* Get the register settings for requested baud rate. */
    if ((f / bps_target) < 2)
    {
        return 0;   /* baud_bps_target too high for the PCLK. */
    }
    /*
     * From Hardware manual: Bit rate = f / (2(n + 1)(2^N))
     * where:
     *      f = PCLK, n = SPBR setting, N = BRDV bits
     * Solving for n:
     *      n = (((f/(2^N))/2) / bps) - 1
     *
     */

    /* Only calculate for BRDV value of 0 (div/1) to get SPBR setting for the board PCLK.
     * BRDV setting will be done during write/read operations. */
    N = 0;
    n = ((f >> (N+1)) / (int32_t)bps_target) - 1;  /* Solve for SPBR setting. */

    if ((n >= 0) && (n <= 0xff))   /* Must be <= SPBR register max value. Must not be negative*/
    {
        /* Now plug n back into the formula for BPS and check it. */
        bps_calc = (uint32_t)(f / (2 *((n + 1) << N)));

        if(bps_calc > bps_target)
        {
            n += 1;
            if (n > 0xff)
            {
                return 0; /* result out of range for the PCLK. */
            }
        }
        spbr_result = n;

        (*g_rspi_channels[channel]).SPBR = spbr_result;    /* Apply the SPBR register value. */
        if (0 == (*g_rspi_channels[channel]).SPBR)
        {
            nop();
        }
        g_ctrl_reg_values[channel].spbr_val = spbr_result; /* Update the channel settings record. */
    }
    else
    {
        bps_calc = 0;  /* result out of range for the PCLK. */
    }

    return bps_calc;    /* Return the actual BPS rate achieved. */
}
/* end of function rspi_baud_set(). */

/***********************************************************************************************************************
* Function Name: rspi_get_data_type
* Description  : Identifies whether the data must be type-cast as 8-bit, 16-bit, or 32-bit for purposes of accessing the
*                source or destination buffers with the right type and index.
* Arguments    : frame_length_bits-
*                   16-bit word containing the bits that define the bits per frame in th SPCMD register.
*                   Only the bits corresponding to "SPB[3:0] RSPI Data Length Setting" of the SPCMDn register are
*                   checked in this argument.
* Return Value : RSPI_BYTE_DATA-
*                   Data is 8-bit.
*                RSPI_WORD_DATA-
*                   Data is > 8-bit and <= 16-bit.
*                RSPI_LONG_DATA-
*                   Data is > 16-bit.
***********************************************************************************************************************/
uint8_t rspi_get_data_type(rspi_command_word_t command_word)
{
    uint8_t data_type;
    uint8_t frame_length_bits;

#if RSPI_LITTLE_ENDIAN == 1
    frame_length_bits = (uint8_t)((command_word.word[0] & RSPI_SPCMD_SPB) >> 8);
#else
    frame_length_bits = (uint8_t)((command_word.word[1] & RSPI_SPCMD_SPB) >> 8);
#endif /* RSPI_LITTLE_ENDIAN == 1 */

    switch (frame_length_bits)
    {
        case RSPI_SPCMD_BIT_LENGTH_8: /* (0x07) 0100 to 0111 = 8 bits data length */
        {
            data_type = RSPI_BYTE_DATA;
        }
        break;

