andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
        case RSPI_SPCMD_BIT_LENGTH_9:   /* (0x08)  1000 = 9 bits data length  */
        case RSPI_SPCMD_BIT_LENGTH_10:  /* (0x09)  1001 = 10 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_11:  /* (0x0A)  1010 = 11 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_12:  /* (0x0B)  1011 = 12 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_13:  /* (0x0C)  1100 = 13 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_14:  /* (0x0D)  1101 = 14 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_15:  /* (0x0E)  1110 = 15 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_16:  /* (0x0F)  1111 = 16 bits data length */
        {
            data_type = RSPI_WORD_DATA;
        }
        break;

        case RSPI_SPCMD_BIT_LENGTH_20:  /* (0x00)  0000 = 20 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_24:  /* (0x01)  0001 = 24 bits data length */
        case RSPI_SPCMD_BIT_LENGTH_32:  /* (0x03)  0011 = 32 bits data length */
        case 0x0002:            /* Alternate setting for 32 bit. */
        {
            data_type = RSPI_LONG_DATA;
        }
        break;

        default:
        {
            data_type = 0;
        }
    }
    return data_type;
}
/* End of function rspi_get_data_access(). */


/***********************************************************************************************************************
* Function Name: power_on_off
* Description : Switches power to an RSPI channel.  Required by FIT spec.
* Arguments : channel -
*                   Which channel to use.
*             on_or_off -
*                   What it says.
* Return Value : none
***********************************************************************************************************************/
static void power_on_off (uint8_t channel, uint8_t on_or_off)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    switch (channel)
    {
        #if RSPI_CFG_USE_CH0 == 1
        case 0:
            MSTP(RSPI0) = on_or_off;
            if (0 == MSTP(RSPI0))
            {
                nop();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        case 1:
            MSTP(RSPI1) = on_or_off;
            if (0 == MSTP(RSPI1))
            {
                nop();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CH2 == 1
        case 2:
            MSTP(RSPI2) = on_or_off;
            if (0 == MSTP(RSPI2))
            {
                nop();
            }
        break;
        #endif

        default:
        break;
    }

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}
/* End of function power_on(). */


/***********************************************************************************************************************
* Function Name: rspi_ir_priority_set
* Description  : sets the shared interrupt priority level for a channel.
* Arguments : channel -
*                 Which channel to use.
*             rspi_priority-
*                 0-15 priority value. 15 = highest priority.
* Return Value : none
***********************************************************************************************************************/
static void rspi_ir_priority_set(uint8_t channel, uint8_t rspi_priority)
{
    #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
    bsp_int_ctrl_t int_ctrl_data;
    int_ctrl_data.ipl = (uint32_t)rspi_priority;
    #endif

    switch (channel)
    {
        #if RSPI_CFG_USE_CH0 == 1
        case 0:
            IPR(RSPI0, SPRI0) = rspi_priority; /* One priority register for all RSPI interrupts (exc RX64M). */
             /* RX64M has individual RSPI interrupt priority registers. Set the rest of them */
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            IPR(RSPI0, SPTI0) = rspi_priority;
            /* Enable the group interrupt for the SPEI0 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI0_SPEI0, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI0, SPRI0))
            {
                nop();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        case 1:
            IPR(RSPI1, SPRI1) = rspi_priority;
            /* RX71M has individual RSPI interrupt priority registers. Set the rest of them */
            #if defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            IPR(RSPI1, SPTI1) = rspi_priority;
            /* Enable the group interrupt for the SPEI1 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI1_SPEI1, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI1, SPRI1))
            {
                nop();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CH2 == 1
        case 2:
            IPR(RSPI2, SPRI2) = rspi_priority;
            #if defined BSP_MCU_RX65N
            IPR(RSPI2, SPTI2) = rspi_priority;
            /* Enable the group interrupt for the SPEI2 interrupt. (sets priority also). */
            R_BSP_InterruptControl(BSP_INT_SRC_AL0_RSPI2_SPEI2, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);
            #endif

            if (0 == IPR(RSPI2, SPRI2))
            {
                nop();
            }
        break;
        #endif

        default:
        break;
    }
}
/* End of function rspi_ir_priority_set(). */

/***********************************************************************************************************************
* Function Name: rspi_interrupts_clear
* Description  : Clear RSPI interrupts.
* Arguments : channel -
*                 Which channel to use.
* Return Value : none
***********************************************************************************************************************/
static void rspi_interrupts_clear(uint8_t channel)
{
    switch (channel)
    {
        #if RSPI_CFG_USE_CH0 == 1
        case 0:
            /* Clear any pending receive buffer full interrupts */
            IR(RSPI0, SPRI0) = 0 ;
            /* Clear any pending transmit buffer empty interrupts */
            IR(RSPI0, SPTI0) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Clear any pending error interrupt */
            IR(RSPI0, SPEI0) = 0;
            #endif
            #endif
            #endif
            #endif
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
                /* Clear the error interrupt status flag. */
                ICU.GRPAL0.BIT.IS17 = 0;
            #endif

            if (0 == IR(RSPI0, SPTI0))
            {
                nop();
            }
        break;
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        case 1:
            /* Clear any pending receive buffer full interrupts */
            IR(RSPI1, SPRI1) = 0 ;
            /* Clear any pending transmit buffer empty interrupts */
            IR(RSPI1, SPTI1) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Clear any pending error interrupt */
            IR(RSPI1, SPEI1) = 0;
            #endif
            #endif
            #endif
            #endif
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
                /* Clear the error interrupt status flag. */
                ICU.GRPAL0.BIT.IS19 = 0;
            #endif

