andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
            if (0 == IR(RSPI1, SPTI1))
            {
                nop();
            }
        break;

        #endif

        #if RSPI_CFG_USE_CH2 == 1
        case 2:
            IR(RSPI2, SPRI2) = 0 ;
            IR(RSPI2, SPTI2) = 0 ;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX65N
            IR(RSPI2, SPEI2) = 0;
            #endif
            #endif
            #if defined BSP_MCU_RX65N
                /* Clear the error interrupt status flag. */
                ICU.GRPAL0.BIT.IS21 = 0;
            #endif

            if (0 == IR(RSPI2, SPTI2))
            {
                nop();
            }
        break;
        #endif

        default:
        break;
    }
    #ifdef BSP_MCU_RX63_ALL
        #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
        IR(ICU, GROUP12) = 0;
        if (0 == IR(ICU, GROUP12))
        {
            nop();
        }
        #endif
    #endif
}
/* End of function rspi_interrupts_enable(). */

/***********************************************************************************************************************
* Function Name: rspi_interrupts_enable
* Description  : Disable or enable RSPI interrupts.
* Arguments : channel -
*                 Which channel to use.
*             enabled-
*                 true = enable, false = disable.
* Return Value : none
***********************************************************************************************************************/
static void rspi_interrupts_enable(uint8_t channel, bool enabled)
{
    switch (channel)
    {
        #if RSPI_CFG_USE_CH0 == 1
        case 0:
            /* Disable or enable receive buffer full interrupt */
            IEN(RSPI0, SPRI0) = enabled;
            /* Disable  or enable transmit buffer empty interrupt */
            IEN(RSPI0, SPTI0) = enabled;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Disable or enable error interrupt */
            IEN(RSPI0, SPEI0) = enabled;
            #endif
            #endif
            #endif
            #endif

            if (0 == IEN(RSPI0, SPTI0))
            {
                nop();
            }
            
            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            if(enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                #if   defined BSP_MCU_RX64M
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, (bsp_int_cb_t)rspi_spei_64m_isr);
                #elif defined BSP_MCU_RX71M
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, (bsp_int_cb_t)rspi_spei_71m_isr);
                #elif defined BSP_MCU_RX65N
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, (bsp_int_cb_t)rspi_spei_65n_isr);
                #else
                #endif
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN17 = 1;
                if (0 == ICU.GENAL0.BIT.EN17)
                {
                    nop();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI0_SPEI0, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN17 = 0;
                if (0 == ICU.GENAL0.BIT.EN17)
                {
                    nop();
                }
            }
            #endif
        break;
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        case 1:
            IEN(RSPI1, SPRI1) = enabled;
            IEN(RSPI1, SPTI1) = enabled;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX64M
            #ifndef BSP_MCU_RX71M
            #ifndef BSP_MCU_RX65N
            /* Disable or enable error interrupt */
            IEN(RSPI1, SPEI1) = enabled;
            #endif
            #endif
            #endif
            #endif

            if (0 == IEN(RSPI1, SPTI1))
            {
                nop();
            }

            #if defined BSP_MCU_RX64M || defined BSP_MCU_RX71M || defined BSP_MCU_RX65N
            if(enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                #if defined BSP_MCU_RX64M
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, (bsp_int_cb_t)rspi_spei_64m_isr);
                #elif defined BSP_MCU_RX71M
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, (bsp_int_cb_t)rspi_spei_71m_isr);
                #elif defined BSP_MCU_RX65N
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, (bsp_int_cb_t)rspi_spei_65n_isr);
                #else
                #endif
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN19 = 1;
                if (0 == ICU.GENAL0.BIT.EN19)
                {
                    nop();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI1_SPEI1, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN19 = 0;
                if (0 == ICU.GENAL0.BIT.EN19)
                {
                    nop();
                }
            }
            #endif
        break;
        #endif

        #if RSPI_CFG_USE_CH2 == 1
        case 2:
            IEN(RSPI2, SPRI2) = enabled;
            IEN(RSPI2, SPTI2) = enabled;
            #ifndef BSP_MCU_RX63_ALL
            #ifndef BSP_MCU_RX65N
            IEN(RSPI2, SPEI2) = enabled;
            #endif
            #endif

            if (0 == IEN(RSPI2, SPTI2))
            {
                nop();
            }

            #if defined BSP_MCU_RX65N
            if(enabled)
            {
                /* Register the error callback function with the BSP group interrupt handler. */
                #if defined BSP_MCU_RX65N
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI2_SPEI2, (bsp_int_cb_t)rspi_spei_65n_isr);
                #else
                #endif
                /* Enable error interrupt source bit */
                ICU.GENAL0.BIT.EN21 = 1;
                if (0 == ICU.GENAL0.BIT.EN21)
                {
                    nop();
                }
            }
            else
            {
                /* De-register the error callback function with the BSP group interrupt handler. */
                R_BSP_InterruptWrite(BSP_INT_SRC_AL0_RSPI2_SPEI2, FIT_NO_FUNC);
                /* Disable error interrupt source bit */
                ICU.GENAL0.BIT.EN21 = 0;
                if (0 == ICU.GENAL0.BIT.EN21)
                {
                    nop();
                }
            }
            #endif
        break;
        #endif

        default:
        break;
    }

    #ifdef BSP_MCU_RX63_ALL
        #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
        IEN(ICU, GROUP12) = enabled;
        if (0 == IEN(ICU, GROUP12))
        {
            nop();
        }
        #endif
    #endif

