andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
}
/* End of function rspi_interrupts_enable(). */


/***********************************************************************************************************************
* Function Name: R_RSPI_GetVersion
* Description : Returns the version of this module. The version number is
* encoded where the top 2 bytes are the major version number and
* the bottom 2 bytes are the minor version number.
* For example, Rev 4.25 would be 0x00040019.
* NOTE: This function is inlined using #pragma inline directive.
* Arguments : none
* Return Value : Version Number
***********************************************************************************************************************/
#pragma inline(R_RSPI_GetVersion)
uint32_t R_RSPI_GetVersion(void)
{
    uint32_t version_number = 0;
    /* Bring in major version number. */
    version_number = ((uint16_t)RSPI_RX_VERSION_MAJOR) << 16;
    /* Bring in minor version number. */
    version_number |= (uint16_t)RSPI_RX_VERSION_MINOR;
    return version_number;
}


/******************************************************************************
* Function Name:    rspi_tx_rx_common
* Description  :    common ISR handler for SPTI and SPRI
* Arguments    :    RSPI channel
* Return Value :    N/A
******************************************************************************/
static void rspi_tx_rx_common(uint8_t channel)
{
    void*       psrc      = g_rspi_tcb[channel].psrc;
    void*       pdest     = g_rspi_tcb[channel].pdest;
    uint16_t    tx_count  = g_rspi_tcb[channel].tx_count;
    uint16_t    rx_count  = g_rspi_tcb[channel].rx_count;
    uint8_t     data_size = g_rspi_tcb[channel].bytes_per_transfer;
    uint32_t    rx_data   = g_rxdata[channel];

    /* Service the hardware first to keep it busy. */
    /* Feed the TX. */
    if(tx_count < g_rspi_tcb[channel].xfr_length)   /* Don't write transmit buffer more than length. */
    {
        if (g_rspi_tcb[channel].do_tx)
        {
            /* Transmit the data. TX data register accessed in long words. */
            if (RSPI_BYTE_DATA == data_size)
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint8_t *)psrc)[tx_count];
            }
            else if(RSPI_WORD_DATA == data_size)
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint16_t *)psrc)[tx_count];
            }
            else // Must be long data. if(RSPI_LONG_DATA == data_size)
            {
                (*g_rspi_channels[channel]).SPDR.LONG = ((uint32_t *)psrc)[tx_count];
            }
        }
        else /* Must be RX only mode, so transmit dummy data for clocking.*/
        {
            /* TX data register accessed in long words. */
            (*g_rspi_channels[channel]).SPDR.LONG = RSPI_DUMMY_TXDATA;
        }
        g_rspi_tcb[channel].tx_count++;
    }

    /* Store the received data in user buffer.
     * Receive data not valid until after first transmission is complete. */
    if (g_rspi_tcb[channel].do_rx_now)
    {
        if (RSPI_BYTE_DATA == data_size)
        {
            ((uint8_t *)pdest)[rx_count-1] = (uint8_t)rx_data;
        }
        else if(RSPI_WORD_DATA == data_size)
        {
            #if RSPI_CFG_MASK_UNUSED_BITS == (1)
            /* Clear unused upper bits of non-standard bit length data transfers. */
            rx_data = (rx_data & g_rspi_tcb[channel].unused_bits_mask);
            #endif
            ((uint16_t *)pdest)[rx_count-1] = (uint16_t)rx_data;
        }
        else  // Must be long data. if(RSPI_LONG_DATA == data_size)
        {
            #if RSPI_CFG_MASK_UNUSED_BITS == (1)
            /* Clear unused upper bits of non-standard bit length data transfers. */
            rx_data &= g_rspi_tcb[channel].unused_bits_mask;
            #endif
            ((uint32_t *)pdest)[rx_count-1] = rx_data;
        }
    }

    /* Check for last data.  */
     if(rx_count == g_rspi_tcb[channel].xfr_length)
     {   /* Last data was transferred. */
         (*g_rspi_channels[channel]).SPCR.BIT.SPRIE = 0;  /* Disable SPRI interrupt. */
         (*g_rspi_channels[channel]).SPCR.BIT.SPE   = 0;  /* Disable RSPI. */
         if (0 == (*g_rspi_channels[channel]).SPCR.BIT.SPE)
         {
             nop();
         }

         #if RSPI_CFG_REQUIRE_LOCK == 1
         /* Release lock for this channel. */
         R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
         #endif

         /* Transfer complete. Call the user callback function passing pointer to the result structure. */
         if((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
         {
             g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
             g_rspi_cb_data[channel].event_code = RSPI_EVT_TRANSFER_COMPLETE;
             g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
         }
    }

     return;
} /* end rspi_transmit_common() */


/******************************************************************************
* Function Name:    rspi_spri0_isr, rspi_spri1_isr, rspi_spri2_isr
* Description  :    RSPI SPRI receive buffer full ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
#if RSPI_CFG_USE_CH0 == 1
#pragma interrupt (rspi_spri0_isr(vect = VECT(RSPI0, SPRI0)))
void rspi_spri0_isr(void)
{
    g_rxdata[0] = (*g_rspi_channels[0]).SPDR.LONG; // Need to read RX data reg ASAP.
    g_rspi_tcb[0].rx_count++;
    rspi_tx_rx_common(0);
} /* end rspi_spri0_isr */
#endif

#if RSPI_CFG_USE_CH1 == 1
#pragma interrupt (rspi_spri1_isr(vect=VECT(RSPI1, SPRI1)))
void rspi_spri1_isr(void)
{
    g_rxdata[1] = (*g_rspi_channels[1]).SPDR.LONG;
    g_rspi_tcb[1].rx_count++;
    rspi_tx_rx_common(1);
} /* end rspi_spri1_isr */
#endif

#if RSPI_CFG_USE_CH2 == 1
#pragma interrupt (rspi_spri2_isr(vect=VECT(RSPI2, SPRI2)))
void rspi_spri2_isr(void)
{
    g_rxdata[2] = (*g_rspi_channels[2]).SPDR.LONG;
    g_rspi_tcb[2].rx_count++;
    rspi_tx_rx_common(2);
} /* end rspi_spri2_isr */
#endif
/* end SPRI  */

