andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
/******************************************************************************
* Function Name:    rspi_spti0_isr, rspi_spti1_isr, rspi_spti2_isr
* Description  :    RSPI SPTI transmit buffer empty ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
#if RSPI_CFG_USE_CH0 == 1
#pragma interrupt (rspi_spti0_isr(vect=VECT(RSPI0, SPTI0)))
void rspi_spti0_isr(void)
{
    g_rxdata[0] = RSPI0.SPDR.LONG; // Read rx-data register into temp buffer.

    /* If master mode then disable further spti interrupts on first transmit.
       If slave mode then we do two transmits to fill the double buffer,
       then disable spti interrupts.
       The receive interrupt will handle any remaining data. */
    if ((RSPI0.SPCR.BIT.MSTR) || (g_rspi_tcb[0].tx_count > 0))
    {
        RSPI0.SPCR.BIT.SPTIE = 0;  /* Disable SPTI interrupt. */
        if (0 == RSPI0.SPCR.BIT.SPTIE)
        {
            nop();
        }
    }

    rspi_tx_rx_common(0);         // Process the data in the common handler.

    if (g_rspi_tcb[0].transfer_mode & RSPI_DO_RX)
    {    /* Count was incremented in the call to rspi_tx_rx_common. */
        if ((RSPI0.SPCR.BIT.MSTR) || (g_rspi_tcb[0].tx_count > 1))
        {
            g_rspi_tcb[0].do_rx_now = true; /* Enables saving of receive data on next receive interrupt. */
        }
    }
} /* end rspi_spti0_isr */
#endif

#if RSPI_CFG_USE_CH1 == 1
#pragma interrupt (rspi_spti1_isr(vect=VECT(RSPI1, SPTI1)))
void rspi_spti1_isr(void)
{
    g_rxdata[1] = RSPI1.SPDR.LONG; // Read rx-data register into temp buffer.

    if ((RSPI1.SPCR.BIT.MSTR) || (g_rspi_tcb[1].tx_count > 0))
    {
        RSPI1.SPCR.BIT.SPTIE = 0;  /* Disable SPTI interrupt. */
        if (0 == RSPI1.SPCR.BIT.SPTIE)
        {
            nop();
        }
    }

    rspi_tx_rx_common(1);         // Process the data in the common handler.

    if (g_rspi_tcb[1].transfer_mode & RSPI_DO_RX)
    {    /* Count was incremented in the call to rspi_tx_rx_common. */
        if ((RSPI1.SPCR.BIT.MSTR) || (g_rspi_tcb[1].tx_count > 1))
        {
            g_rspi_tcb[1].do_rx_now = true; /* Enables saving of receive data on next receive interrupt. */
        }
    }
} /* end rspi_spti1_isr */
#endif

#if RSPI_CFG_USE_CH2 == 1
#pragma interrupt (rspi_spti2_isr(vect=VECT(RSPI2, SPTI2)))
void rspi_spti2_isr(void)
{
    g_rxdata[2] = RSPI2.SPDR.LONG; // Read rx-data register into temp buffer.

    if ((RSPI2.SPCR.BIT.MSTR) || (g_rspi_tcb[2].tx_count > 0))
    {
        RSPI2.SPCR.BIT.SPTIE = 0;  /* Disable SPTI interrupt. */
        if (0 == RSPI2.SPCR.BIT.SPTIE)
        {
            nop();
        }
    }

    rspi_tx_rx_common(2);         // Process the data in the common handler.

    if (g_rspi_tcb[2].transfer_mode & RSPI_DO_RX)
    {    /* Count was incremented in the call to rspi_tx_rx_common. */
        if ((RSPI2.SPCR.BIT.MSTR) || (g_rspi_tcb[2].tx_count > 1))
        {
            g_rspi_tcb[2].do_rx_now = true; /* Enables saving of receive data on next receive interrupt. */
        }
    }
} /* end rspi_spti2_isr */
#endif
/* end SPTI  */

/******************************************************************************
* Function Name:    rspi_spei_isr_common
* Description  :    common ISR handler for SPEI RSPI-error
* Arguments    :    RSPI channel
* Return Value :    N/A
******************************************************************************/
void rspi_spei_isr_common(uint8_t channel)
{
    uint8_t status_flags = (*g_rspi_channels[channel]).SPSR.BYTE;
    rspi_evt_t event = RSPI_EVT_ERR_UNDEF;

    /* Identify and clear error condition. */
    if(status_flags & RSPI_SPSR_OVRF) // Overrun error.
    {
        if (RSPI_EVT_ERR_UNDEF == event)
        {
            event = RSPI_EVT_ERR_READ_OVF;
        }
        /* Clear error source: OVRF flag. */
        (*g_rspi_channels[channel]).SPSR.BIT.OVRF = 0;
    }
    
    if (status_flags & RSPI_SPSR_MODF)
    {
        if (status_flags & RSPI_SPSR_UDRF)
        {
            if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_UNDER_RUN;
            }
            /* Clear error source: MODF flag and UDRF. */
            (*g_rspi_channels[channel]).SPSR.BYTE &= RSPI_SPSR_MODF_UDRF_MASK;
        }
        else
        {
            if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_MODE_FAULT;
            }
            /* Clear error source: MODF flag. */
            (*g_rspi_channels[channel]).SPSR.BIT.MODF = 0;
        }
    }
    
    if (status_flags & RSPI_SPSR_PERF)
    {
        if (RSPI_EVT_ERR_UNDEF == event)
        {
            event = RSPI_EVT_ERR_PARITY;
        }
        /* Clear error source: PERF flag. */
        (*g_rspi_channels[channel]).SPSR.BIT.PERF = 0;
    }

    g_rspi_cb_data[channel].event_code = event;

    /* Disable the RSPI operation. */
    (*g_rspi_channels[channel]).SPCR.BYTE &= (uint8_t)(~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE | RSPI_SPCR_SPE));
    if (0 == (*g_rspi_channels[channel]).SPCR.BYTE)
    {
        nop();
    }

    #if RSPI_CFG_REQUIRE_LOCK == 1
    /* Release lock for this channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
    #endif

    /* Call the user callback function passing pointer to the result structure. */
    if((FIT_NO_FUNC != g_rspi_handles[channel].pcallback) && (NULL != g_rspi_handles[channel].pcallback))
    {
        g_rspi_cb_data[channel].handle = &(g_rspi_handles[channel]);
        g_rspi_handles[channel].pcallback((void*)&(g_rspi_cb_data[channel]));
    }
} /* end rspi_spei_isr_common() */


/******************************************************************************
* Function Name:    rspi_spei0_isr, rspi_spei1_isr, rspi_spei2_isr
* Description  :    RSPI SPEI RSPI-error ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
#ifndef BSP_MCU_RX63_ALL  /* This interrupt not present in RX63 or RX64M series. */
#ifndef BSP_MCU_RX64M
#ifndef BSP_MCU_RX65N
#ifndef BSP_MCU_RX71M
    #if RSPI_CFG_USE_CH0 == 1
    #pragma interrupt (rspi_spei0_isr(vect=VECT(RSPI0, SPEI0)))
    void rspi_spei0_isr(void)
    {
        rspi_spei_isr_common(0);
    } /* end rspi_spei0_isr */
    #endif

    #if RSPI_CFG_USE_CH1 == 1
    #pragma interrupt (rspi_spei1_isr(vect=VECT(RSPI1, SPEI1)))
    void rspi_spei1_isr(void)
    {
        rspi_spei_isr_common(1);
    } /* end rspi_spei1_isr */
    #endif

