andrecurvello/RX63N-Collection/SDCard/trash/fit_2017-01-16 21_59_31/r_rspi_rx/src/r_rspi_rx.c
    #if RSPI_CFG_USE_CH2 == 1
    #pragma interrupt (rspi_spei2_isr(vect=VECT(RSPI2, SPEI2)))
    void rspi_spei2_isr(void)
    {
        rspi_spei_isr_common(2);
    } /* end rspi_spei2_isr */
    #endif
#endif
#endif
#endif
#endif

#ifdef BSP_MCU_RX63_ALL
    #if RSPI_CFG_USE_RX63_ERROR_INTERRUPT == 1
    #pragma interrupt (rspi_spei_63_isr(vect=VECT(ICU, GROUP12)))
    void rspi_spei_63_isr(void)
    {
        /* Get the interrupt source from the group interrupt source register. */
        #if RSPI_CFG_USE_CH0 == 1
        if (IS(RSPI0, SPEI0))
        {
            rspi_spei_isr_common(0);
        }
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        if (IS(RSPI1, SPEI1))
        {
            rspi_spei_isr_common(1);
        }
        #endif

        #if RSPI_CFG_USE_CH2 == 1
        if (IS(RSPI2, SPEI2))
        {
            rspi_spei_isr_common(2);
        }
        #endif
    } /* end rspi_spei_63_isr */
    #endif
#endif

#ifdef BSP_MCU_RX64M
    /* Called from BSP group interrupt handler. */
    void rspi_spei_64m_isr(void *pdata)
    {
        if (IS(RSPI0, SPEI0))
        {
            rspi_spei_isr_common(0);    // RX64M only has channel 0.
        }
    } /* end rspi_spei_64m_isr */
#endif
#ifdef BSP_MCU_RX71M
    /* Called from BSP group interrupt handler. */
    void rspi_spei_71m_isr(void *pdata)
    {
        #if RSPI_CFG_USE_CH0 == 1
        if (IS(RSPI0, SPEI0))
        {
            rspi_spei_isr_common(0);
        }
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        if (IS(RSPI1, SPEI1))
        {
            rspi_spei_isr_common(1);
        }
        #endif
    }
#endif
#ifdef BSP_MCU_RX65N
    /* Called from BSP group interrupt handler. */
    void rspi_spei_65n_isr(void *pdata)
    {
        #if RSPI_CFG_USE_CH0 == 1
        if (IS(RSPI0, SPEI0))
        {
            rspi_spei_isr_common(0);
        }
        #endif

        #if RSPI_CFG_USE_CH1 == 1
        if (IS(RSPI1, SPEI1))
        {
            rspi_spei_isr_common(1);
        }
        #endif

        #if RSPI_CFG_USE_CH2 == 1
        if (IS(RSPI2, SPEI2))
        {
            rspi_spei_isr_common(2);
        }
        #endif
    }
#endif
/* end SPRI  */
